name: Newly created account in the last 7 days that is added to administrators group 
description: |
  ''
requiredDataConnectors:
  - connectorId: IdentityInfo
    dataTypes:
      - IdentityInfo
tactics:
relevantTechniques:

query: 

  IdentityInfo
| where AccountCreationTime < ago(7d)
| where GroupMembership contains "admin"
