{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        },
        "query_id": {
            "defaultValue": "[newGuid()]",
            "type": "String"
        }
    },
    "resources": [
        {
            "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
            "apiVersion": "2020-08-01",
            "name": "[concat(parameters('workspace'), '/', parameters('query_id'))]",
            "location": "[resourceGroup().location]",
            "properties": {
                "category": "Hunting Queries",
                "displayName": "Anomalous login activity originated from Botnet, Tor proxy or C2",
                "query": "BehaviorAnalytics\r\n  | where ActivityType == 'LogOn' or ActivityType == 'FailedLogOn'\r\n  | where DevicesInsights.ThreatIntelIndicatorType == 'Botnet' \r\n    or DevicesInsights.ThreatIntelIndicatorType == 'C2' \r\n    or DevicesInsights.ThreatIntelIndicatorType == 'Proxy'\r\n  | where ActivityInsights contains 'True'\r\n   | extend AadUserId = UsersInsights.AccountObjectID\n| extend Account_0_AadUserId = AadUserId",
                "tags": [
                    {
                        "name": "description",
                        "value": "Shows login activity (successful or failed) originated from botnet, Tor proxy or C2, with at least one 'True' activity insight"
                    }
                ],
                "version": 2
            }
        }
    ]
}