{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        },
        "query_id": {
            "defaultValue": "[newGuid()]",
            "type": "String"
        }
    },
    "resources": [
        {
            "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
            "apiVersion": "2020-08-01",
            "name": "[concat(parameters('workspace'), '/', parameters('query_id'))]",
            "location": "[resourceGroup().location]",
            "properties": {
                "category": "Hunting Queries",
                "displayName": "Anomalous update Key Vault activity by high blast radius user ",
                "query": "BehaviorAnalytics\r\n  | where ActivityType == \"Administrative\"\r\n  | where ActionType == \"Update Key Vault\"\r\n  | where UsersInsights.BlastRadius == \"High\"\r\n  | where ActivityInsights.FirstTimeActionPerformedInTenant == true or\r\n    ActivityInsights.FirstTimeUserPerformedAction == true or\r\n    ActivityInsights.FirstTimeConnectionFromCountryObservedInTenant == true\r\n    | extend AadUserId = UsersInsights.AccountObjectID\n| extend Account_0_AadUserId = AadUserId",
                "tags": [
                    {
                        "name": "description",
                        "value": "Shows all update Key Vault activities done by a user with a High blast radius. If the activity is performed for the first time (by the user or in the tenant) or if the activity originated in a never seen before country"
                    }
                ],
                "version": 2
            }
        }
    ]
}